---
kind: method
id: M:Autodesk.Revit.DB.FabricationItemFile.IsLoaded
source: html/a6632107-ec1f-5bb1-09e7-72620f4fda9a.htm
---
# Autodesk.Revit.DB.FabricationItemFile.IsLoaded Method

Checks to see if the item file has been loaded into the configuration.

## Syntax (C#)
```csharp
public bool IsLoaded()
```

## Returns
Returns true if the item file has been loaded into the configuration, false otherwise.